[
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What is eZhire",
    "text": "Q: What is eZhire? A: eZhire makes it easy for you to get a rental car — from ordering and delivery to customer service and extension, our app features are powerful alone, but they're even better together. No deposit required."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "How is eZhire different from traditional car rental",
    "text": "Q: How is eZhire different from traditional car rental? A: At eZhire, we don't require customers to provide a deposit on any car rental. This makes it easy and convenient for our customers to get the car they need when they need it. We're committed to making your rental car experience as frictionless as possible. That's why we don't require a deposit when you rent with us. We believe that deposits for car rental are a thing of the past, and we're excited to offer our customers a simpler way to rent. eZhire offers the fastest delivery, anywhere, on-demand, 24/7 as well as free pickup from one of our many locations in the UAE. When you're planning a trip, the last thing you want to worry about is transportation. With eZhire, you can easily order rental car online, so you can focus on what matters most: enjoying your trip. We're breaking down the barriers to car rental for as many people as possible. By making it more affordable and accessible, we're opening up new opportunities for everyone. eZhire wants to make sure that everyone has the opportunity to order a car, regardless of their background. We believe that everyone deserves the chance to enjoy the freedom of the open road. Unlike traditional car rental companies, we accept debit cards as payment for ordering a car."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What type of vehicles are available from eZhire",
    "text": "Q: What type of vehicles are available from eZhire? A: There is a wide selection of cars available on the app, and we can get you whatever car you want. If not, we’ll get you an upgrade at the same price. You can choose from economy cars like the Mitsubishi Attrage and Nissan Sunny to SUVs like the Nissan Pathfinder. We also offer luxury and exotic cars like Lamborghini Huracan and Rolls Royce Phantom."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Do you offer monthly car rentals",
    "text": "Q: Do you offer monthly car rentals? A: eZhire offers monthly car rental in Dubai at highly discounted and competitive rates. We have a large fleet of cars to choose from, so you can find the perfect one for your needs. Plus, our app makes it easy to reserve a car for any length of time. Contact us today to learn more about our monthly car rental services."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Do you offer chauffeur services",
    "text": "Q: Do you offer chauffeur services? A: Absolutely. We have a team of experienced, reliable, and safe drivers who will take you wherever you need to go. Our rates are very reasonable, and we always offer the best possible service. Contact us today for more information or to book your ride."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What are eZhire’s operating hours",
    "text": "Q: What are eZhire’s operating hours? A: eZhire offers the fastest delivery, anywhere, on-demand, 24/7 as well as free pickup from one of our many locations in the UAE."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "How do I order a rental car",
    "text": "Q: How do I order a rental car? A: You can order a rental car on the eZhire app, and get it delivered, on-demand. The app offers an easy way to compare prices and find the best deal for your needs. You can also order a car for as little as one day or for as many months as you like. So if you need a car for a short trip, or if you're planning a longer vacation, the eZhire app has you covered. Plus, there's no need to worry about hidden fees or add-ons; all of our rates are upfront and transparent. No deposit required."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "How do I contact customer support",
    "text": "Q: How do I contact customer support? A: If you encounter any issues with your hired car, please feel free to reach out to us via the chat feature on the eZhire app. We are dedicated to ensuring that your rental experience is as seamless as possible, and we're here to assist you every step of the way."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "How come you don’t require a deposit",
    "text": "Q: How come you don’t require a deposit? A: We want to make car rental as easy and accessible as possible, which is why we don't require a deposit. We believe that every person should have the opportunity to drive, and that's why we work hard to break down the barriers to car rental. Plus, our rates are always affordable, so you can get behind the wheel without breaking the bank."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Can I extend my order",
    "text": "Q: Can I extend my order? A: You can absolutely extend your rental from the app. In fact, we always recommend that people do it ahead of time to avoid any possible issues. However, please keep in mind that you have to do it at least 3 hours before the end of your rental. That way, you're not left scrambling if something comes up. For more, please check out the extension and collection policy."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Can I get the car delivered and collected",
    "text": "Q: Can I get the car delivered and collected? A: Yes, you can get your rental car delivered and collected from eZhire. It's perfect for those who don't want to deal with the hassle of picking up and dropping off a rental car at a rental agency."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Where is delivery available",
    "text": "Q: Where is delivery available? A: We deliver all over the UAE."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Can I make an order and get it delivered at night",
    "text": "Q: Can I make an order and get it delivered at night? A: Yes, our delivery service is available 24/7. Simply order your car through the app, and choose the delivery time that works best for you. We'll take care of the rest!"
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "How long does delivery take",
    "text": "Q: How long does delivery take? A: It usually takes a couple of hours for your rental car to be delivered. You can track the delivery on the app."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What time is delivery & collection available",
    "text": "Q: What time is delivery & collection available? A: eZhire is committed to getting your car delivered to you when you need it most! We operate 24/7 and are able to deliver the car at any time of the day or night!"
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Can I pick up the car",
    "text": "Q: Can I pick up the car? A: Yes, you can pick up your vehicle from one of our many locations for free."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Do I need to be present during the delivery of your vehicle",
    "text": "Q: Do I need to be present during the delivery of your vehicle? A: Yes, you will need to be present when we deliver your car. We will need to confirm your identification in order to complete the delivery. Thank you for your cooperation!"
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What happens if I do not make payments on time",
    "text": "Q: What happens if I do not make payments on time? A: If you do not make payments, we will start the force collection procedure. This means that your car will be immobilized until you pay the amount you owe. We strongly advise against this, as it will only cause you more stress and headaches. Make payments on time to avoid any such issues. Thank you for understanding."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Will I be charged if I return the car later than delivery/self pickup time",
    "text": "Q: Will I be charged if I return the car later than delivery/self pickup time? A: Yes, the vehicle must be returned at the same time as delivery/self-pickup, If not then a penalty of 1-day charge is applicable. Collection/Self-return must be raised via the app at least 3 hour prior to your return time."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What is the minimum order length",
    "text": "Q: What is the minimum order length? A: The eZhire minimum order length for car rental is one day. This means that you must rent a car for at least one day in order to use the service. Thanks for considering eZhire!"
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Will I get charged if I cancel my order",
    "text": "Q: Will I get charged if I cancel my order? A: If you've placed an order and change your mind, don't worry – we don't charge cancellation fees if you cancel before the car is dispatched. Once the driver is on their way to pick you up, though, the fee will stand. If you have any questions, get in touch with our customer service team. We're always happy to help!"
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Which payment methods do you support",
    "text": "Q: Which payment methods do you support? A: We accept all Credit and Debit Cards. Upload your card details on our secure platform and we will handle the rest."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "How do I add a payment card",
    "text": "Q: How do I add a payment card? A: To add a payment card on the app, you can either add it to your wallet or else during the ordering process. If you're adding it to your wallet, just open up the menu and select 'Add Credit/Debit Card'. If you're adding it during the ordering process, first enter your shipping address and then select 'Payment Method. From there, just tap on 'Add Credit/Debit Card' and enter all of the required information."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "How do I remove a payment card",
    "text": "Q: How do I remove a payment card? A: Remove it from your wallet, and if you have an active order, you will need to replace it."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Is it safe to add my card details to the App",
    "text": "Q: Is it safe to add my card details to the App? A: Yes, our payment gateway is secure. We use the latest encryption technology to ensure that your data is safe and secure. Your card details are never stored on our servers, and we will never sell your data to third parties."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "How can I check my order receipt",
    "text": "Q: How can I check my order receipt? A: After your order has been delivered, we’ll email you a receipt showing the number of liters dispensed, the price per liter, and the total amount charged to your card."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What add-ons are available with ezhire",
    "text": "Q: What add-ons are available with ezhire? A: Our add-ons include additional drivers, upgraded insurance, GPS, and baby seats. You can see the full list of add-ones here."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Can I add an additional driver",
    "text": "Q: Can I add an additional driver? A: Yes, you can add an additional driver while ordering your car, or at any time while you are a customer. If you are a customer, please contact the team via the in-app chat to add a driver. The rates are as follows: Daily: 25 AED / Day Weekly: 105 AED / Day Monthly: 150 AED / Month"
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What happens if an accident occurs",
    "text": "Q: What happens if an accident occurs? A: In the event of an accident, you must notify the police immediately. You should not move the vehicle until the police issue a report or advise you to do so. Failure to submit a police report will render you liable for all costs incurred as a result of the accident and will result in no insurance coverage. If it's your mistake and you are provided with a Red Police Report - maximum liability will be charged. If you decide to take full insurance for an extra charge, you will not be charged any excess for a Red Report as long as a valid police report is provided. Punctures, tyre damage, wheel caps, aerials, and windscreens are not covered by insurance even after getting full insurance coverage."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What are the traffic fines in the UAE",
    "text": "Q: What are the traffic fines in the UAE? A: The traffic fines in the UAE vary depending on the severity of the offense. As a general rule, fines tend to be higher for offenses that cause danger to other road users. To see the full list, please check out our guide to traffic fines."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What is driving like in the UAE",
    "text": "Q: What is driving like in the UAE? A: Renting a car and driving in the UAE can be an incredible experience, as long as you're aware of the unique conditions and rules that apply. In general, traffic is orderly and drivers are courteous. Lane discipline is usually good, and there's rarely any congestion on the roads. That said, there are a few things to watch out for. The first is that it's against the law to use your mobile phone while driving, so make sure you hands-free kit if you need to take a call. Secondly, there are special rules governing how to overtake camels on the road - make sure you familiarize yourself with these before setting out."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What side of the road do people drive on in the UAE",
    "text": "Q: What side of the road do people drive on in the UAE? A: People drive on the right side of the road in the UAE."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Are car rentals automatic or manual",
    "text": "Q: Are car rentals automatic or manual? A: They are almost always automatic. However, there are a few rental companies that offer manual transmission cars for those who prefer them. Just be sure to ask when making your order."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Is it safe to drive in the UAE",
    "text": "Q: Is it safe to drive in the UAE? A: Yes, it is safe to drive in the UAE. The roads are well-maintained and the drivers are generally very cautious. There are a few things to keep in mind when driving in the UAE, however. First, be aware of the high speeds that people tend to drive at, especially on highways. Second, make sure to always carry your driver's license and car registration paperwork with you when driving; you may be asked to show them if stopped by police. Third, watch out for camels and other animals that wander onto the road; they can cause serious accidents. Finally, drink plenty of water while driving in the summer months as it can get very hot and humid."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What is the minimum age to rent a car in the UAE",
    "text": "Q: What is the minimum age to rent a car in the UAE? A: UAE Residents:"
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What documents are required for UAE residents to rent a car",
    "text": "Q: What documents are required for UAE residents to rent a car? A: Valid UAE Driving License (front and back) Emirates ID (front and back) Valid Passport and Visa page"
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What documents are required for visitors/tourists to rent a car",
    "text": "Q: What documents are required for visitors/tourists to rent a car? A: Valid Home Country Driving License International Driving License Valid Passport with Visa stamp"
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Are there any special requirements for corporate clients",
    "text": "Q: Are there any special requirements for corporate clients? A: For"
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "How do I dispute eZhire rental charges or fines",
    "text": "Q: How do I dispute eZhire rental charges or fines? A: If you're disputing fines related to your eZhire rental, follow these steps: Choose the appropriate authority's dispute page from the list below. Authority Dispute Pages: Dubai - RTA Dispute Page Abu Dhabi - Abu Dhabi Police Dubai - Dubai Police Fines Inquiry Ajman - Ajman Police Sharjah - Sharjah Police Ras Al Khaimah - RAK Municipality Violation Appeal Umm Al Quwain/Fujairah : Use the MOI app . Log in, select Help > Complain , and provide violation details. Complete their dispute resolution process"
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "How long does it take to process a refund",
    "text": "Q: How long does it take to process a refund? A: Refunds are processed within 3-7 working days, depending on your bank and the dispute evidence."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "Can I receive a refund before the dispute is resolved",
    "text": "Q: Can I receive a refund before the dispute is resolved? A: No, refunds are issued only after you provide proof of winning the dispute."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What if I lose the dispute",
    "text": "Q: What if I lose the dispute? A: If the dispute is not in your favor, you remain responsible for any fines or charges."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What is eZhire's Privacy Policy",
    "text": "Q: What is eZhire's Privacy Policy? A: Please have a look at eZhire's privacy policy here ."
  },
  {
    "url": "https://www.ezhire.ae/uae-car-rental-faqs",
    "source": "FAQ",
    "section": "What are eZhire's terms and conditions",
    "text": "Q: What are eZhire's terms and conditions? A: Please have a look at eZhire's terms and conditions here ."
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "Terms and Conditions\nIntroduction\nDefinitions\nServices\nEligibility, registration, verification\nDriving License Requirements:\nChanges in Status:\nUse of the Services\nUser Accounts:\nUser Requirements and Conduct:\nText Messaging/Push notifications:\nEmail Communications:\nPromotional Codes:\nWallet Credit Use:\nUser-Provided Content:\nGoverning Law:\nSeverability:\nViewing Your Account History:\nCancellations of Confirmed Reservations, Refunds, Vehicle Lease Subscription:\nDisputes\nRefunds\nNetwork Access and Devices:\nLicense:\nRestrictions:\nThird-Party Services and Content:\nOwnership:\nPayment, Security & Extra Mileage\nPayment mode:\nEarly Return Policy:\nSecurity deposit:\nDelivery & Collection:\nLate Collection/Self Return:\nInsurance and its criteria:\nComprehensive Insurance:\nFull Insurance:\nKSA Terms & Conditions:\nExtra Mileage\nNon-Rental Charges Criteria:\nDisclaimer\nImportant note:\nPlease read these terms and conditions carefully as they regulate the relationship between you and eZhire Technologies FZ-LLC. By accessing and using the platform, you acknowledge that you have read, understood, and agreed to be bound fully and unconditionally to these terms and conditions. eZhire reserves the right to"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "and using the platform, you acknowledge that you have read, understood, and agreed to be bound fully and unconditionally to these terms and conditions. eZhire reserves the right to revise these terms and conditions. If you do not agree with these terms and conditions, you must stop using or accessing all ezhire platforms immediately. All the faqs and fees listed on all ezhire platforms are part of these terms and conditions.\nIntroduction\neZhire Technologies FZ-LLC and its subsidiaries (collectively, ‘eZhire’, ‘we’ or ‘us’) provide online car rental services for residents and visitors. eZhire is easily accessible and compatible with both IOS, Android, and Huawei phones. The website, mobile application, and associate services are collectively referred to as “the services”.\nDefinitions\nThe following terms are used throughout these terms and conditions and have the following meanings\nAccount: It means the account that the Users are required to register through the App and/or the Platform to use the Services including the required documents needed to complete the Account registration.\nRental: The client pays for the days the car is rented out or if any add-ons are added, they will also"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "ncluding the required documents needed to complete the Account registration.\nRental: The client pays for the days the car is rented out or if any add-ons are added, they will also be considered as rental.\nAdd-ons: All additional services provided by eZhire inclusive of an additional driver, full insurance, and personal accidental insurance. All add-ons such as GPS, and baby seats are subject to availability.\nNon-Rental Charges: means charges that may be incurred by the Client as a result of the Client's use of a vehicle including, but not limited to, traffic and parking fines, toll fees, fuel charges, excess mileage fees, insurance premiums, and Payment Default Penalty Charges.\nAgreement and Terms & Conditions: All terms and conditions and notices contained or referenced in this document (as mentioned from time to time) and all other rules and regulations available on all platforms (including but not limited to the Privacy Policy, guidelines, and procedures that may be published from time to time on the Platform).\nApp: Mobile application that displays all of eZhire’s services and charges including current on-hires and previous hiring rental history.\nOrdering Confirmation: Any, and"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "latform).\nApp: Mobile application that displays all of eZhire’s services and charges including current on-hires and previous hiring rental history.\nOrdering Confirmation: Any, and all written or electronically transmitted confirmation orders sent by eZhire for a vehicle that may contain, including without limitation, reservation number, the description of the vehicle, pick-up location, date and time, drop-off location, date, and time, payment terms, quantity, duration of the vehicle being rented and any special condition.\nOrdering ID: A specific Ordering reference on each vehicle’s Ordering via the application and confirmation upon ordering.\nCustomer/Client: 'You’ or ‘your’ collectively means a person or company renting out the vehicle via the eZhire app and/or platform.\nDiscount: Any promo code (of an amount or value) which is given by eZhire to an individual (client) to apply on any Ordering of their choice contingent on the promo’s expiry date.\nExtensions: If the client would like an extension on the rental for an additional period than the initial Ordering.\nEarly Return Charges: This means the penalty charges payable by the Client in the event of early termination of a Vehicle"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "ental for an additional period than the initial Ordering.\nEarly Return Charges: This means the penalty charges payable by the Client in the event of early termination of a Vehicle Rental Agreement by the Client.\nPlatform: This means any online tool provided, processed, and/or maintained by eZhire (including, but not limited to, through eZhire’s App, website, all subpages, and subdomains, all Content, Services, and products available at or through the Platform located at https://www.ezhire.ae/ or any other related domain offering access to, or facilitating the provision of, the Services).\nFleet Partner: The car will be assigned/delivered to you by one of our partners/vendors. Partner is a locally registered car rental company that owns the rental vehicle.\nVehicle: This means the vehicle of a Vendor enrolled within the Platform that has been rented by a Client or agreed by a Vendor to be rented out to a Client through the Platform, and that includes its parts, components, accessories, and registration documents.\nService: This means the online and/or offline services, provided by eZhire for the provision and use of the technology that eZhire has developed for collaboration, communicat"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "ents.\nService: This means the online and/or offline services, provided by eZhire for the provision and use of the technology that eZhire has developed for collaboration, communication, and payment between the Vendors and the Clients, including without limitation access to the eZhire App, online community, communication tools, and payment services.\nWallet: This is for our users to add credit for future purchases such as rental or non-rental, or just keep extra credit in time of need.\nServices\neZhire provides a technology platform that enables users of the mobile application or website to be provided as part of the Services (each, an “Application”).\nThe application arranges and schedules transportation and logistics services with independent third-party providers of such services, including independent third-party transportation providers and independent third-party logistics providers under agreement with eZhire or certain affiliates (“Third Party Providers”).\nUnless otherwise agreed by eZhire in a separate written agreement with you, the Services are made available solely for your personal, noncommercial use.\nYOU ACKNOWLEDGE THAT eZhire DOES NOT PROVIDE TRANSPORTATION OR LOGISTICS"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "e written agreement with you, the Services are made available solely for your personal, noncommercial use.\nYOU ACKNOWLEDGE THAT eZhire DOES NOT PROVIDE TRANSPORTATION OR LOGISTICS SERVICES OR FUNCTION AS A TRANSPORTATION CARRIER AND THAT ALL SUCH TRANSPORTATION OR LOGISTICS SERVICES ARE PROVIDED BY INDEPENDENT THIRD PARTY CONTRACTORS WHO ARE NOT EMPLOYED BY eZhire OR ANY OF ITS AFFILIATES.\nEligibility, registration, verification\nThe minimum age for hiring a car is18 years for UAE residentsand21 years for visitors/tourists.\nA validdriving licensemust be presented at the time of placing the order.\nFor UAE Residents:A valid UAE driving license, Emirates ID, passport, and visa page are required.\nFor Visitors/Tourists:A valid home country license, international driving license, and a passport with visa stamp are required.\nFor Corporate Clients (Etihad, Emirates, Masdar):Staff ID must be provided in addition to the standard documents.\nBookings that fail to meet the above eligibility or documentation requirements may be canceled or rejected.\nDriving License Requirements:\nThe renter and driver must be in possession of a valid driving license. United Arab Emirates residents require a United"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "s may be canceled or rejected.\nDriving License Requirements:\nThe renter and driver must be in possession of a valid driving license. United Arab Emirates residents require a United Arab Emirates driver's license. Drivers from GCC countries, Gulf Cooperation Council, are required to present an original passport as GCC identification cards are not accepted. Clients on resident/employment visas or visas under processing must have a UAE driving license. In some cases, If the UAE driving license is less than a year old, then a supporting home country driver's license showing that the driver has been driving for more than 1 year is required. Clients from Japan, the Republic of Korea, Greece, and Turkey are requested to have a translation of their driving license, which must be approved by their embassy or consulate. Clients from China are requested to have a notarized translation of their driving license.\nValid national driving licenses from the following countries are accepted:\nNorth America:Canada, USA\nEast Asia & Pacific:Australia, China, Hong Kong, Japan, New Zealand, Singapore, South Korea\nEurope:Austria, Belgium, Denmark, Finland, France, Germany, Greece, Ireland, Italy, Luxembourg"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "sia & Pacific:Australia, China, Hong Kong, Japan, New Zealand, Singapore, South Korea\nEurope:Austria, Belgium, Denmark, Finland, France, Germany, Greece, Ireland, Italy, Luxembourg, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Spain, Sweden, Switzerland, Turkey, United Kingdom\nMiddle East:Bahrain, Kuwait, Oman, Saudi Arabia, Qatar\nAfrica:International driving license needed.\nInternational clients also have to be in possession of an international driving license. Please note this may vary depending on RTA rules and regulations.\nChanges in Status:\nClients must immediately notify eZhire in the case of the occurrence of any of the below-mentioned events:\nIf a client’s driver’s license has been suspended, expired, surrendered, withdrawn, lost, or is no longer valid for any other reason.\nIf a client is involved in a traffic accident while operating one of eZhire’s vehicles.\nIn the case of a change of contact information: email address and mobile phone number etc.\nIf a client's credit card information changes.\nBy refraining from informing eZhire about any of the above-mentioned events, a client’s contract with eZhire may be suspended or terminated. Contingent upon the nature"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "on changes.\nBy refraining from informing eZhire about any of the above-mentioned events, a client’s contract with eZhire may be suspended or terminated. Contingent upon the nature of the change, eZhire retains the right to request clients to provide an updated copy of their official driving record.\nUse of the Services\nUser Accounts:\nIn order to use most aspects of the Services, clients must register for and maintain an active personal user Services account (“Account”). Clients must be at least 18 years of age, or the age of legal majority in their jurisdiction (if different than 18), to obtain an Account. Account registration requires Clients to submit certain personal information, such as the client’s name, address, mobile phone number, age, and at least one valid payment method (either a credit card or accepted payment partner).\nClients agree to maintain accurate, complete, and up-to-date information in their accounts. Failure to maintain accurate, complete, and up-to-date Account information, including having an invalid or expired payment method on file, may result in your inability to access and use the Services or eZhire’s termination of these Terms with the client.\nClients ar"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "having an invalid or expired payment method on file, may result in your inability to access and use the Services or eZhire’s termination of these Terms with the client.\nClients are also responsible for all activity that occurs under their account and agree to maintain the security and secrecy of their Account username and password at all times. Unless otherwise permitted by eZhire in writing, they may only possess one Account. In addition to this, clients must have one account on a single device.\nUser Requirements and Conduct:\nThe Service is not available for use by individuals under the age of 18. Clients may not authorize third parties to use their accounts, and may not allow individuals under the age of 18 to receive transportation or logistics services from Third Party Providers unless they are accompanied by the client. Additionally, clients may not assign or otherwise transfer their accounts to any other person or entity.\nClients agree to comply with all applicable laws when using the Services, and may only use the Services for lawful purposes (e.g., no transport of unlawful or hazardous materials). They will not, in their use of the Services, cause nuisance, annoyance, inco"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "may only use the Services for lawful purposes (e.g., no transport of unlawful or hazardous materials). They will not, in their use of the Services, cause nuisance, annoyance, inconvenience, or property damage, whether to the Third Party Provider or any other party. In certain instances, clients may be asked to provide proof of identity to access or use the Services, and clients agree that they may be denied access to or use of the Services if they refuse to provide proof of identity.\nText Messaging/Push notifications:\nBy creating an Account, clients agree that the Services may send them text (SMS) messages or push notifications as part of the normal business operation of their use of the Services. Clients may opt out of receiving text (SMS) messages from eZhire at any time.\nEmail Communications:\neZhire uses email and electronic means to stay in touch with their clients. For contractual purposes, Clients:\nConsent to receive communications from eZhire in an electronic form via the email address they have submitted or via the Platform.\nAgree that all Terms and Conditions, agreements, notices, disclosures, and other communications that eZhire provides to them electronically satisfy an"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "ubmitted or via the Platform.\nAgree that all Terms and Conditions, agreements, notices, disclosures, and other communications that eZhire provides to them electronically satisfy any legal requirement that such communications would satisfy if they were in a physical writing or traditional mailing.\nPromotional Codes:\neZhire may, in its sole discretion, create promotional codes that may be redeemed for Account credit, or other features or benefits related to the Services and/or a Third Party Provider’s services, subject to any additional terms that eZhire establishes on a per promotional code basis (“Promo Codes”).\nClients agree that Promo Codes:\nMust be used for the intended audience and purpose, and in a lawful manner.\nMay not be duplicated, sold, or transferred in any manner, or made available to the general public (whether posted to a public form or otherwise), unless expressly permitted by eZhire.\nMay be disabled by eZhire at any time for any reason without liability to eZhire.\nMay only be used according to the specific terms that eZhire establishes for such Promo Code.\nAre not valid for cash.\nMay expire prior to the client’s use.\nEvery Promo Code has a certain validity and upon"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "g to the specific terms that eZhire establishes for such Promo Code.\nAre not valid for cash.\nMay expire prior to the client’s use.\nEvery Promo Code has a certain validity and upon reaching that, it will expire.\neZhire reserves the right to withhold or deduct credits or other features or benefits obtained through the use of Promo Codes by the client or any other user in the event that eZhire determines or believes that the use or redemption of the Promo Code was in error, fraudulent, illegal, or in violation of the applicable Promo Code terms or these terms.\nWallet Credit Use:\nAs part of your User account, eZhire may provide you with access to features of wallet in the eZhire application which may allow you to: (i) manage payment for Services; (ii) add and store prepaid credit balance (“eZhire credit”); Fee, usage and limits may be modified by eZhire from time to time.\nUser-Provided Content:\nIn eZhire’s sole discretion, clients are permitted from time to time to submit, upload, publish or otherwise make available to eZhire through the Services textual, audio, and/or visual content and information, including commentary and feedback related to the Services, initiation of support reque"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "ailable to eZhire through the Services textual, audio, and/or visual content and information, including commentary and feedback related to the Services, initiation of support requests, and submission of entries for competitions and promotions (“User Content”). Any User Content provided by clients remains their property.\nHowever, by providing User Content to eZhire, clients grant eZhire a worldwide, perpetual, irrevocable, transferrable, royalty-free license, with the right to sublicense, use, copy, modify, create derivative works of, distribute, publicly display, publicly perform, and otherwise exploit in any manner such User Content in all formats and distribution channels now known or hereafter devised (including in connection with the Services and eZhire’s business and on third-party sites and services), without further notice to or consent from the client, and without the requirement of payment to the client or any other person or entity.\nThe Client represents and warrants:\nClients either are the sole and exclusive owners of all User Content or have all rights, licenses, consents, and releases necessary to grant eZhire the license to the User Content as set forth above.\nNeither"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "and exclusive owners of all User Content or have all rights, licenses, consents, and releases necessary to grant eZhire the license to the User Content as set forth above.\nNeither the User Content nor the clients’ submission, uploading, publishing or otherwise making available of such User Content nor eZhire’s use of the User Content as permitted herein will infringe, misappropriate, or violate a third party’s intellectual property or proprietary rights, or rights of publicity or privacy, or result in the violation of any applicable law or regulation.\nClients agree to not provide User Content that is defamatory, libellous, hateful, violent, obscene, pornographic, unlawful, or otherwise offensive, as determined by eZhire in its sole discretion, whether or not such material may be protected by law. eZhire may, but shall not be obligated to, review, monitor, or remove User Content, at eZhire’s sole discretion and at any time and for any reason, without notice to the client.\nGoverning Law:\nThis Agreement between a client and eZhire and any access to or use of the Platform or the Service by a Client is governed by:\nThe laws and regulations of the United Arab Emirates as applied by the"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "ween a client and eZhire and any access to or use of the Platform or the Service by a Client is governed by:\nThe laws and regulations of the United Arab Emirates as applied by the Dubai International Financial Centre for Customers in UAE.\nThe laws and regulations of the Qatari jurisdiction and courts for Customers in Qatar.\nThe laws and regulations of the Bahraini jurisdiction and courts for Customers in Bahrain.\nThe law and regulations of the Saudi Arabian jurisdiction and courts for Customers in Saudi Arabia.\nThe law and regulations of the Omani jurisdiction and courts for Customers in Oman.\nThe law and regulations of the Kuwaiti jurisdiction and courts for Kuwaiti Customers.\nThe law and regulations of the Pakistani jurisdiction and courts for Pakistani Customers.\nAny dispute which may arise between the Client and eZhire pertaining to the implementation or interpretation of this Agreement shall be amicably settled, failing which the Small Claims Tribunal of the Dubai International Financial Centre, or any relevant jurisdiction of the location in which the Ordering was created, shall be the competent authority to settle the same.\nSeverability:\nIf any part of this Agreement is held"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "ny relevant jurisdiction of the location in which the Ordering was created, shall be the competent authority to settle the same.\nSeverability:\nIf any part of this Agreement is held invalid or unenforceable, that part of the Agreement will be construed to reflect the party’s original intent.\nThe remaining portions will remain in full force and effect. Any failure on the part of eZhire to enforce any provision of this Agreement will not be considered a waiver of our right to enforce such provision.\neZhire’s rights under this Agreement will survive any termination of this Agreement.\nViewing Your Account History:\nAt present, clients can access the following information through the eZhire application:\nRental and payment history\nAccount statements and information\nIncurred fees and charges\nClients must understand and agree that eZhire has no duty to provide clients with rental, billing, payment, or other account information or reminders in any other way.\nClients are responsible for checking, managing, and updating their accounts, rental, billing, and payment information.\nDuring an active reservation, if the payment is declined regardless of the amount, the vehicle may be immobilized unles"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "ng their accounts, rental, billing, and payment information.\nDuring an active reservation, if the payment is declined regardless of the amount, the vehicle may be immobilized unless the declined payment is settled. This includes - rental payment, Salik, any fines, or accidental damage.\nCancellations of Confirmed Reservations, Refunds, Vehicle Lease Subscription:\nCancellations of Confirmed Reservations and Refunds:\nThe client agrees and accepts that a confirmed reservation will be valid for 24 hours starting from the confirmation of the vendor, after which it will be cancelled automatically.\nAll cancellations of confirmed reservations by the client must be communicated directly to eZhire. If the client cancels, despite having confirmed their reservation, within 3 hours while providing prior notice to the handover of the vehicle, the cancellation will be processed without a penalty and the Lease Payment (or part thereof) that has been received by eZhire will be refunded to the Client. This is subject to any associated cost, including, but not limited to credit card fees.\nIf the client is cancelling the Ordering (Self-pickup) from the counter no amount will be charged to the client.\nI"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "associated cost, including, but not limited to credit card fees.\nIf the client is cancelling the Ordering (Self-pickup) from the counter no amount will be charged to the client.\nIf the client is cancelling the Ordering upon receiving the car then the Delivery fee + 1-day rental will be charged from the client.\nClients expressly release eZhire of any and all liabilities related to the Vehicle Rental. The client agrees and acknowledges that eZhire is not responsible for resolving any disputes between clients and vendors, whether related to the cancellation of a confirmed reservation, or the processing of any changes to a Confirmed Reservation, or otherwise. eZhire disclaims any and all liability in this regard. If you have any inquiries about cancellations or reservations, please contact us at connect@ezhire.life or via the Platform.\nThe client agrees and acknowledges that the Rental Payments are subject to the Vehicle Rental Agreement and in no event may eZhire be held liable for the refund of the Rental Payment and the Additional Fees.\nAny amount which is above 20 AED (US$ 5.00) can be processed for a refund through the original mode of payment and/or credited to the wallet. The a"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "Payment and the Additional Fees.\nAny amount which is above 20 AED (US$ 5.00) can be processed for a refund through the original mode of payment and/or credited to the wallet. The amounts under AED 20 (US$ 5.00) or lower will only be credited to the eZhire wallet.\nDisputes\nIf you're disputing fines related to your eZhire rental, follow these steps:\nChoose the appropriate authority's dispute page from the list below.\nAuthority Dispute Pages:\nDubai - RTA Dispute Page\nAbu Dhabi - Abu Dhabi Police\nDubai - Dubai Police Fines Inquiry\nAjman - Ajman Police\nSharjah - Sharjah Police\nRas Al Khaimah - RAK Municipality Violation Appeal\nUmm Al Quwain/Fujairah: Use theMOI app. Log in, selectHelp>Complain, and provide violation details.\nComplete their dispute resolution process.\nRefunds\nWe process refunds only after a dispute is successfully resolved in your favor. Share your dispute resolution details with us for assistance.\nNetwork Access and Devices:\nClients are responsible for obtaining the data network access necessary to use the Services. Their mobile network’s data and messaging rates and fees may apply if clients access or use the Services from a wireless-enabled device and will be responsi"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "ry to use the Services. Their mobile network’s data and messaging rates and fees may apply if clients access or use the Services from a wireless-enabled device and will be responsible for such rates and fees.\nClients are responsible for acquiring and updating compatible hardware or devices necessary to access and use the Services and Applications and any updates thereto. eZhire does not guarantee that the Services, or any portion thereof, will function on any particular hardware or devices.\nIn addition, the Services may be subject to malfunctions and delays inherent in the use of the Internet and electronic communications.\nLicense:\nSubject to the client’s compliance with these Terms, eZhire grants a limited, non-exclusive, non-sublicensable, revocable, non-transferable license to:\nAccess and use the Applications on the client’s personal device solely in connection with their use of the Services.\nAccess and use any content, information, and related materials that may be made available through the Services, in each case solely for personal, and non-commercial use. Any rights not expressly granted herein are reserved by eZhire and eZhire’s licensors.\nRestrictions:\nClients may not:\nRem"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "in each case solely for personal, and non-commercial use. Any rights not expressly granted herein are reserved by eZhire and eZhire’s licensors.\nRestrictions:\nClients may not:\nRemove any copyright, trademark, or other proprietary notices from any portion of the Services.\nReproduce, modify, prepare derivative works based upon, distribute, license, lease, sell, resell, transfer, publicly display, publicly perform, transmit, stream, broadcast, or otherwise exploit the Services except as expressly permitted by eZhire.\nDecompile, reverse engineer, or disassemble the Services except as may be permitted by applicable law.\nLink to, mirror, or frame any portion of the Services.\nCause or launch any programs or scripts for the purpose of scraping, indexing, surveying, or otherwise data mining any portion of the Services or unduly burdening or hindering the operation and/or functionality of any aspect of the Services.\nAttempt to gain unauthorized access to or impair any aspect of the Services or its related systems or networks.\nDefames harasses, abuses threatens or incites violence towards any individual or group.\nDo any unlawful or promotes unlawful activity.\nSmoking is not allowed in the Ca"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "or networks.\nDefames harasses, abuses threatens or incites violence towards any individual or group.\nDo any unlawful or promotes unlawful activity.\nSmoking is not allowed in the Car.\nWe have the right to, in our sole discretion, determine whether or not any Client conduct is appropriate and complies with these Terms and Conditions.\nWe also have the right to terminate or deny access to and use of any Account and the Service to any Client for any reason, with or without prior notice.\nThird-Party Services and Content:\nThe Services may be made available or accessed in connection with third-party services and content (including advertising) that eZhire does not control.\nClients acknowledge that different terms of use and privacy policies may apply to their use of such third-party services and content. eZhire does not endorse such third-party services and content and in no event will be responsible for insurance information for any products or services of such third-party providers.\nAdditionally, Apple Inc., Google, Inc, Microsoft Corporation, BlackBerry Limited and/or their applicable international subsidiaries and affiliates will be third-party beneficiaries of this contract if the cli"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "ogle, Inc, Microsoft Corporation, BlackBerry Limited and/or their applicable international subsidiaries and affiliates will be third-party beneficiaries of this contract if the client accesses the Services using Applications developed for Apple IOS and Android mobile devices, respectively.\nThese third-party beneficiaries are not parties to this contract and are not responsible for the provision or support of the Services in any manner. The client’s access to the Services using these devices is subject to terms outlined in the applicable third-party beneficiary’s terms of service.\nOwnership:\nThe Services and all rights therein are and shall remain eZhire’s property or the property of eZhire’s licensors. Neither these Terms nor the client’s use of the Services conveys or grants to the client any rights:\nIn or related to the Services except for the limited license granted above.\nTo use or reference in any manner eZhire’s company names, logos, product and service names, trademarks, or service marks or those of eZhire’s licensors.\nPayment, Security & Extra Mileage\nPayment mode:\nWe accept all Credit and Debit Cards for rental and non-rental payments. All fees, penalties, and trip charges"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "f eZhire’s licensors.\nPayment, Security & Extra Mileage\nPayment mode:\nWe accept all Credit and Debit Cards for rental and non-rental payments. All fees, penalties, and trip charges will be automatically deducted from the authorized credit/debit card provided during the Ordering. The client must ensure that the credit card information associated with Orderings is always up to date and that there are sufficient funds available to cover any amount owed. Fees and charges incurred by clients are not refundable except in the case of fraudulent activities not caused by the clients.\nOnce you submit your registration, there will be a refundable charge of AED 3.67 (or equivalent to US$ 1.00 for credit/debit card validation).\nA refund can be done through the Original Mode of Payment as well as in the eZhire wallet. However, any amount which is equal to AED 20 (US$5.00) or lower can only be credited to the user’s wallet.\nA refund can be done through the Original Mode of Payment as well as in the eZhire wallet.\nClients are solely responsible for all credit card, banking, service, cellular, data, or access fees or charges incurred in relation to any payment to eZhire in terms of insufficient fun"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "s are solely responsible for all credit card, banking, service, cellular, data, or access fees or charges incurred in relation to any payment to eZhire in terms of insufficient funds or the use of any of the services and features.\nFor all payments taken against a client's credit card, eZhire will send a payment confirmation email to the registered email address. This will be sent within 48-72 hours of the payment.\nRefund TAT (Turn around time) is 7-10 working days in case of any disputes or cancellations after confirmation. If a Ordering is cancelled before confirmation the amount is refunded within 24 hours\nMultiple Orderings may result in multiple postings to the cardholder’s monthly statement. The cardholder must retain a copy of transaction records and Merchant policies and rules.\nPrepaid cards are not accepted under any circumstances.\nWith regards to repairing and cleaning fees, clients will be responsible for the cost of repair for damage to, or the necessary cleaning of, Third Party Provider vehicles and property resulting from use of the Services under the client’s Account more than normal “wear and tear” damages and necessary cleaning (“Repair or Cleaning”).\nIf a Third-Par"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "es and property resulting from use of the Services under the client’s Account more than normal “wear and tear” damages and necessary cleaning (“Repair or Cleaning”).\nIf a Third-Party Provider reports the need for Repair or Cleaning, and such Repair or Cleaning request is verified by eZhire at eZhire’s reasonable discretion, eZhire reserves the right to facilitate payment for the reasonable cost of such Repair or Cleaning on behalf of the Third-Party Provider using the client’s payment method designated in your Account. Such amounts will be transferred by eZhire to the applicable Third-Party Provider and are non-refundable.\nClients shall be responsible for taxes (VAT) as applicable, any processing fees associated with their use of the Services and Vehicle Rental, and any credit card fees and banking transaction fees (if applicable).\nEarly Return Policy:\nThe Early Return policy allows customers to return the rental vehicle prior to the originally Ordered rental period. Please note that rental rates may vary based on the original Ordering period and the requested early return date.\nNormal Booking\nBookings of 30 days or more:\nIf a vehicle booked for 30 days or more is returned even 1 d"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "based on the original Ordering period and the requested early return date.\nNormal Booking\nBookings of 30 days or more:\nIf a vehicle booked for 30 days or more is returned even 1 day earlier than the originally requested duration, and the actual usage falls below 30 days, the rental rate will be recalculated from monthly to weekly, based on the total days used.\nBookings of 7 days or more but less than 30 days:\nIf a vehicle booked for 7 days or more but less than 30 days is returned even 1 day earlier than the originally requested duration, and the actual usage falls below 7 days, the rental rate will be recalculated from weekly to daily, based on the total days used.\nSubscription Booking\n1-3 Months Tenure:\nIf the original subscription ordering is for any tenure but returned between 1-3 months: Charges will revert to regular monthly/weekly/daily rates based on the completed duration.\n4-6 Months Tenure:\nIf the original subscription ordering is for 4-6 months: Early Returned within the same tenure before completion: 1-3 months tenure charges will apply.\n7-9 Months Tenure:\nIf the original subscription ordering is for 7-9 months: Early Returned within the same tenure before completion:"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "pletion: 1-3 months tenure charges will apply.\n7-9 Months Tenure:\nIf the original subscription ordering is for 7-9 months: Early Returned within the same tenure before completion: 4-6 months charges will apply.\n10-12 Months Tenure:\nIf the original subscription ordering is for 10-12 months: Early Returned within the same tenure before completion: 7-9 months charges will apply.\nAll discounts will be voided in the case of early return. This applies to both normal and subscription bookings.\n●Subscribe To Own Booking\n1. Extra kilometer charges will apply if the lease is terminated early apply.\n2. An early termination fee will also be charged as follow.\na.1st year: 3 months’ rent as penalty\nb.2nd year: 2 months’ rent\nc.3rd year: 1 month’s rent\n3. An invoice will be issued for both early termination and excess mileage.\nDiscounts and Limitations:\nPromo codes can only be utilized for daily and weekly bookings.\nOnce a booking turns into a monthly booking, any applied promo code discount will be removed or be limited to a discount of AED 100, any excess discount will be removed\nIntercity Charges:\nThe intercity charges for the mentioned routes are to be charged as following:\nDubai to Abu Dhabi"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "d to a discount of AED 100, any excess discount will be removed\nIntercity Charges:\nThe intercity charges for the mentioned routes are to be charged as following:\nDubai to Abu Dhabi: 139.99\nAbu Dhabi to Dubai: 139.99\nAjman to Dubai: 119.99\nDubai to Ajman: 119.99\nAl Ain to Dubai: 139.99\nDubai to Al Ain: 139.99\nFujairah to Dubai: 139.99\nDubai to Fujairah: 139.99\nRas Al Khaima to Dubai: 139.99\nDubai to Ras Al Khaima: 139.99\nSharjah to Dubai: 79.99\nDubai to Sharjah: 79.99\nDubai to Umm Al Quwain: 139.99\nUmm Al Quwain to Dubai: 139.99\nSecurity deposit:\nWe generally do not take any form of security deposit; however, it depends on each hiring while validating documents. eZhire reserves the right to ask for security deposits during the document verification process, at their sole discretion.\nDelivery & Collection:\nDelivery and collection charges are as follows:\nUAE: AED 39.00, each way, exclusive of VAT\nOman: OMR 3.00 each way, exclusive of VAT\nBahrain: BHD 2.00 each way, exclusive of VAT\nQatar: QAR 39.00 each way\nPakistan: PKR 250, each way, exclusive of tax.\nSaudia: SAR 39, each way, exclusive of tax.\nOne of the eZhire partners closest to the pickup location will deliver the car to the cli"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "Pakistan: PKR 250, each way, exclusive of tax.\nSaudia: SAR 39, each way, exclusive of tax.\nOne of the eZhire partners closest to the pickup location will deliver the car to the client. eZhire operates 24/7 and can deliver the car depending on availability in the pickup area and as per the availability of the car.\nLate Collection/Self Return:\nThe vehicle must be returned at the same time as delivery/self pickup.\nCollection/Self return must be raised via app at least 3 hour prior to your return time, otherwise penalty of 1 day charge is applicable.\nInsurance and its criteria:\nComprehensive Insurance:\nAll cars come with comprehensive insurance as per UAE law. In the event of an accident or damage, clients must notify the police immediately and should not move the vehicle until the police issue a report or advise them to do so. Failure to submit a police report will render clients liable for all costs incurred as a result of the accident and will result in no insurance coverage.\nIf the police report provided is ‘Green’, clients will not be charged as this was not the fault of the clients.\nIf the police report is ‘Red’, there will be excess insurance charges depending on the type of car"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "is ‘Green’, clients will not be charged as this was not the fault of the clients.\nIf the police report is ‘Red’, there will be excess insurance charges depending on the type of car and the extent of damage caused.\nIf it is the client’s mistake and a ‘Red’ police report is provided - maximum liability will be charged (This only applies if additional full insurance is not included in the rental).\nHit andRun Charge Policy:In case of ahit andrun, an excess charge of AED 1250 for hatchbacks and sedans. For SUVs or bigger, a charge of up to AED 3000 will apply.\nFull Insurance:\nIf the clients decide to take full insurance for an extra charge, they will not be charged any excess for a ‘Red’ Report as long as a valid police report is provided.\nNote: Punctures, tire damage, wheel caps, aerials, and windscreens are not covered by insurance even after getting full insurance coverage.\nFor full information about insurance until caused due to an accident where a 3rd party is involved. Check outfull insurance details here.\nImportant Notein case you want to add additional driver, If the car met an accident on the same day the additional driver was added and a police report as well generated on same"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "e.\nImportant Notein case you want to add additional driver, If the car met an accident on the same day the additional driver was added and a police report as well generated on same day, that additional driver will not be covered by the insurance. Additionally Full Insurance will only cover any accident 24 Hours after insurance is added.\nKSA Terms & Conditions:\nCheck outKSA Full Insurance details.\nExtra Mileage\nMileage will be effective from the start of the booking upon exceeding excess mileage will be charged depending on the car category.\nUAE:There is a limitation on mileage based on the days you have rented out the vehicle\nDaily: 225 KM\nWeekly: 1400 KM\nMonthly: 2000 or 4000 KM depending on user selection when Ordering\nIf the mileage is exceeded, you will be charged based on the below criteria\nHatchback - 0.50\nSmall Sedan - 0.50\nMid Size Sedan - 0.50\nFull Size Sedan - 0.80\nMid Size Suv - 0.80\nFull Size Suv - 1 AED\nLuxury: AED 5.00 per kilometer\nOman:There is a limitation on mileage based on the days you have rented out the vehicle.\nDaily:250 KM\nWeekly: 1400 KM\nMonthly: 4000 KM\nIf the mileage is exceeded, you will be charged based on the below criteria:\nEconomy: OMR 0.035 per kilo"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "have rented out the vehicle.\nDaily:250 KM\nWeekly: 1400 KM\nMonthly: 4000 KM\nIf the mileage is exceeded, you will be charged based on the below criteria:\nEconomy: OMR 0.035 per kilometre\nSedan: OMR 0.035 per kilometre\nSUV: OMR 0.050 per kilometre\nFull Sedan: OMR 0.050 per kilometre\nLuxury: OMR 0.080 per kilometre\nBahrain:There is a limitation on mileage based on the days you have rented out the vehicle\nDaily: 300 KM\nWeekly: 1175 KM\nMonthly: 5000 KM\nIf the mileage is exceeded, you will be charged based on the below criteria:\nEconomy: BHD 0.035 per kilometre\nSedan: BHD 0.035 per kilometre\nSUV: BHD 0.050 per kilometre\nFull Sedan: BHD 0.050 per kilometre\nLuxury: BHD 0.080 per kilometre\nQatar:There is a limitation on mileage based on the days you have rented out the vehicle\nDaily: 300 KM\nWeekly: 1750 KM\nMonthly: 2500/5000 KM depending on user selection when Ordering\nIf the mileage is exceeded, you will be charged based on the below criteria:\nEconomy: QAR 0.20 per kilometre\nSedan: BHD 0.25 per kilometre\nSUV: BHD 0.25 per kilometre\nFull Sedan: BHD 0.30 per kilometre\nLuxury: BHD 0.40 per kilometre\nNon-Rental Charges Criteria:\nAll non-rental charges include Fines, Toll gates, Excess Mileage,"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "0.25 per kilometre\nFull Sedan: BHD 0.30 per kilometre\nLuxury: BHD 0.40 per kilometre\nNon-Rental Charges Criteria:\nAll non-rental charges include Fines, Toll gates, Excess Mileage, Fuel charges, and damages.\nClients will be charged on the card provided at the time of the Ordering for any non-rental charges. eZhire will always send an email/notification to the client with details and will charge directly.\nThe fines, in particular, will be charged to the client’s credit/debit card once the fine updates are provided to the vendor by the transport authority of the respective city/country.\nThere is a surcharge on fines up to 15% plus the fine amount.\nIn the case of other surcharges, the same will be communicated to the client via the Ordering confirmation email. All non-rental charges vary from case to case and from country to country.\nDisclaimer\neZhire makes no representation or warranty that the information provided directly or through the Service is accurate, reliable, or correct; that the Service will meet the client’s requirements; that the Service will be available at any particular time or location, that the Service will function uninterruptedly or be secure; that any defects or"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "the client’s requirements; that the Service will be available at any particular time or location, that the Service will function uninterruptedly or be secure; that any defects or errors will be corrected; or that the Service is free of viruses or other harmful components. Clients assume full responsibility and risk of loss resulting from their use of information, content, or other material obtained from the Vendor or Service.\nClients are solely responsible for all of their communications and interactions with Vendors, as applicable, and with other persons with whom they communicate or interact as a result of the use of the Services. Clients understand that eZhire is not required to screen or inquire into the background of any Vendors or Vehicle Lease, nor does eZhire make any attempt to verify the statements of Vendors.\neZhire makes no representations or warranties as to the conduct of Vehicle Lease and has no control over and does not guarantee the existence, quality, freshness, safety / Roadworthiness, or legality of any Vehicle Lease advertised by Vendors; the ability of Vendors to undertake the Vehicle Lease; or that the Vendor Service will be available at any particular time,"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "or legality of any Vehicle Lease advertised by Vendors; the ability of Vendors to undertake the Vehicle Lease; or that the Vendor Service will be available at any particular time, or location. eZhire does not warrant or guarantee that any Vehicle Lease offered through the Platform will meet a Client's requirements. Clients agree to take reasonable precautions in all communications and interactions with Vendors, and with other persons with whom they communicate or interact as a result of their use of the Services, particularly if they decide to communicate via other means than the Services or to meet in person.\nImportant note:\nTechnical Errors and Pricing Adjustments:eZhire strives to ensure all pricing and calculations within the app are accurate. However, in the event of a technical error resulting in incorrect pricing or calculation, eZhire reserves the right to adjust the charges accordingly. Customers will be notified of any discrepancies and resolutions. eZhire also reserves the right to either refund or charge the customer for the correct amount.\nBy accepting these Terms and Conditions, you agree to accept the Terms and Conditions of our Fleet Partner which are mentioned in"
  },
  {
    "url": "https://www.ezhire.ae/terms-and-conditions",
    "source": "TnC",
    "section": "Terms and Conditions",
    "text": "nd or charge the customer for the correct amount.\nBy accepting these Terms and Conditions, you agree to accept the Terms and Conditions of our Fleet Partner which are mentioned in the rental agreement that you will/may be asked to sign at the time of vehicle handover.\nYOU ACKNOWLEDGE THAT YOUR USE OF OUR APP, ITS CONTENT, OR SERVICES IS AT YOUR SOLE RISK AND YOU ASSUME FULL RESPONSIBILITY AND RISK OF LOSS ARISING FROM YOUR USE OF INFORMATION OR CONTENT OBTAINED FROM A VENDOR OR THE SERVICES."
  }
]